Tekla.Structures.Drawing.Operations.Operation
Operations for drawing objects.

Tekla.Structures.Drawing.Operations.Operation.MergeMarks(System.Collections.Generic.IList{Tekla.Structures.Drawing.MarkBase},System.Collections.Generic.List{Tekla.Structures.Drawing.MarkBase}@)
Merges given marks objects.
NOTE!! Merge requires the original mark content to be similar and of same type. Operation does not support associative notes, mark sets or template content.
The following example enumerates through all parts in all views and inserts
marks for all those parts, the marks are placed in the middle of the part.
using System;
using System.Collections.Generic;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Drawing;
using TSD = Tekla.Structures.Drawing;
class Example
{
public void MergeMarksTest()
{
DrawingHandler drawingHandler = new DrawingHandler();
var drawing = drawingHandler.GetActiveDrawing();
if (drawing != null)
{
List<MarkBase> markstoBeMerged = new List<MarkBase>();
// pick marks to be merged
ViewBase pickedView;
DrawingObject mark;
var picker = drawingHandler.GetPicker();
bool continuePicking = true;
while (continuePicking)
{
try
{
var message = "Pick mark " + (markstoBeMerged.Count + 1).ToString() + " to be merged. Press Esc to finish..";
picker.PickObject(message, out mark, out pickedView);
if (mark == null || pickedView == null || !(mark is Tekla.Structures.Drawing.MarkBase))
continuePicking = false;
else
markstoBeMerged.Add(mark as MarkBase);
}
catch
{
continuePicking = false;
}
}
if (markstoBeMerged.Count > 1)
{
List<MarkBase> mergedMarks = new List<MarkBase>();
TSD.Operations.Operation.MergeMarks(markstoBeMerged, out mergedMarks);
if (mergedMarks.Count > 0)
{
drawing.CommitChanges();
drawingHandler.SaveActiveDrawing();
Console.WriteLine("Merge operation successfull with " + mergedMarks.Count.ToString() + " merged marks..");
}
else
{
Console.WriteLine("Merge operation failed..");
}
}
}
}
}
marks: Contains the of marks to be merged
mergedMarks: Merged marks
Returns: True in case of success, false otherwise

Tekla.Structures.Drawing.Operations.Operation.SplitMarks(System.Collections.Generic.IList{Tekla.Structures.Drawing.MarkBase})
Splits given marks to original marks.
The following example enumerates through all parts in all views and inserts
marks for all those parts, the marks are placed in the middle of the part.
using System;
using System.Collections.Generic;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Drawing;
using TSD = Tekla.Structures.Drawing;
class Example
{
public void SplitMarksTest()
{
DrawingHandler drawingHandler = new DrawingHandler();
var drawing = drawingHandler.GetActiveDrawing();
if (drawing != null)
{
List<MarkBase> markstoBeSplitted = new List<MarkBase>();
// pick marks to be splitted
ViewBase pickedView;
DrawingObject mark;
var picker = drawingHandler.GetPicker();
bool continuePicking = true;
while (continuePicking)
{
try
{
var message = "Pick mark " + (markstoBeSplitted.Count + 1).ToString() + " to be splitted. Press Esc to finish..";
picker.PickObject(message, out mark, out pickedView);
if (mark == null || pickedView == null || !(mark is Tekla.Structures.Drawing.MarkBase))
continuePicking = false;
else
markstoBeSplitted.Add(mark as MarkBase);
}
catch
{
continuePicking = false;
}
}
if (markstoBeSplitted.Count > 0)
{
if(TSD.Operations.Operation.SplitMarks(markstoBeSplitted))
{
drawing.CommitChanges();
drawingHandler.SaveActiveDrawing();
Console.WriteLine("Split operation successfull..");
}
else
{
Console.WriteLine("Split operation failed..");
}
}
}
}
}
marks: Contains the list of marks to be splitted
Returns: True in case of success, false otherwise

Tekla.Structures.Drawing.Operations.Operation.SortObjectsByPresentationOrder(System.Collections.Generic.IList{Tekla.Structures.Drawing.DrawingObject},System.Collections.Generic.List{Tekla.Structures.Drawing.DrawingObject}@)
Sorts objects relatively by presentation order from active drawing.
Result is used to define relative drawing order of objects which are on top of each other.
Last object from the list is drawn on top of all objects.
The following example enumerates through all objects in all views and gets
relative layers of objects.
using System;
using System.Collections.Generic;
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Drawing;
using TSD = Tekla.Structures.Drawing;
class Example
{
public void MergeMarksTest()
{
DrawingHandler drawingHandler = new DrawingHandler();
var drawing = drawingHandler.GetActiveDrawing();
if (drawing != null)
{
List<DrawingObject> drawingObjects = new List<DrawingObject>();
// pick marks to be merged
ViewBase pickedView;
DrawingObject drawingObject;
var picker = drawingHandler.GetPicker();
bool continuePicking = true;
while (continuePicking)
{
try
{
var message = "Pick object " + (drawingObjects.Count + 1).ToString() + " layer to be asked. Press Esc to finish..";
picker.PickObject(message, out drawingObject, out pickedView);
if (drawingObject == null || pickedView == null || !(drawingObject is DrawingObject))
continuePicking = false;
else
drawingObjects.Add(drawingObject as DrawingObject);
}
catch
{
continuePicking = false;
}
}
if (drawingObjects.Count > 1)
{
List<DrawingObject> sortedObjects = new List<DrawingObject>();
TSD.Operations.Operation.SortObjectsByPresentationOrder(drawingObjects, out sortedObjects);
if (layers.Count > 0)
{
Console.WriteLine("SortObjectsByPresentationOrder operation successful with " + layers.Count.ToString() + " layers..");
}
else
{
Console.WriteLine("SortObjectsByPresentationOrder operation failed..");
}
}
}
}
}
objects: Contains the objects layers are asked from
objectsByPresentationOrder: Contains objects sorted by presentation order
Returns: True in case of success, false otherwise

Tekla.Structures.Drawing.Operations.Operation.DbOperation(Tekla.Structures.Drawing.Operations.dotOperationCommand_e,System.Boolean@,Tekla.Structures.DrawingInternal.dotGrString_t@)
